In [497]:
import numpy as np
import pandas as pd

In [498]:
dict1={
    "name":['Harry', 'Rohan', 'Skillf', 'Shubh'],
    "marks":[92,34, 24, 17],
    "city":['Rampur','Bareilly', 'Andra', 'Antartica']
}

In [499]:
df=pd.DataFrame(dict1)

In [500]:
df

     name  marks       city
0   Harry     92     Rampur
1   Rohan     34   Bareilly
2  Skillf     24      Andra
3   Shubh     17  Antartica

In [501]:
#to see the top most data
df.head(2)

    name  marks      city
0  Harry     92    Rampur
1  Rohan     34  Bareilly

In [502]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   marks   4 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [503]:
#the numerical data are shown in details, like marks
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [504]:
#to convert into the csv file
df.to_csv('friends.csv')

In [505]:
#to hide the index
df.to_csv('friends_index_false.csv', index=False)

In [506]:
#to see the last most data
df.tail(1)

    name  marks       city
3  Shubh     17  Antartica

In [507]:
read=pd.read_csv('demo.csv')

In [508]:
read

     name  marks       city
0   Harry     92     Rampur
1   Rohan     34    Kolkata
2  Skillf     24   Bareilly
3   Shubh     17  Antartica

In [509]:
# to read only the particular row like name, city etc
read['name']

0     Harry
1     Rohan
2    Skillf
3     Shubh
Name: name, dtype: object

In [510]:
# we even can read the data in the particular index like:

read['name'][0]

'Harry'

In [511]:
read['name'][0]='Harry'

/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_16937/454520273.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  read['name'][0]='Harry'

In [512]:
# even can change the data,
read['marks'][0]=99
# although it is showing the warning, but the code has been  updated!!

/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_16937/2093934311.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  read['marks'][0]=99
/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_16937/2093934311.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  read['marks'][0]=99

In [513]:
read

     name  marks       city
0   Harry     99     Rampur
1   Rohan     34    Kolkata
2  Skillf     24   Bareilly
3   Shubh     17  Antartica

In [514]:
#to convert in to a csv file
read.to_csv('read1.csv', index=False)

In [515]:
#it also allow to custom index
read.index=['first', 'Second','Third', 'Fourt']

In [516]:
read

          name  marks       city
first    Harry     99     Rampur
Second   Rohan     34    Kolkata
Third   Skillf     24   Bareilly
Fourt    Shubh     17  Antartica

In [517]:
#creating a data frame in the form of row and columns
newdf =pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [518]:
#printning the data frame
newdf

            0         1         2         3         4
0    0.449980  0.173804  0.406991  0.750502  0.288611
1    0.565045  0.875446  0.675996  0.800321  0.148256
2    0.503652  0.643002  0.746705  0.449030  0.359206
3    0.303958  0.981712  0.485845  0.456453  0.751505
4    0.091031  0.772639  0.802083  0.144733  0.186428
..        ...       ...       ...       ...       ...
329  0.691870  0.392796  0.493666  0.318807  0.147284
330  0.642040  0.771727  0.462133  0.317996  0.563462
331  0.978465  0.377199  0.594443  0.646245  0.683017
332  0.628358  0.283826  0.438093  0.017947  0.361380
333  0.175887  0.282770  0.222401  0.140203  0.776492

[334 rows x 5 columns]

In [519]:
#to know the type 
type(newdf)

pandas.core.frame.DataFrame

In [520]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.492066    0.505379    0.493094    0.499763    0.507934
std      0.292007    0.285162    0.289363    0.294407    0.287871
min      0.000671    0.003509    0.001296    0.001846    0.000617
25%      0.235597    0.245240    0.239539    0.236890    0.276226
50%      0.479619    0.521833    0.485642    0.507280    0.516877
75%      0.747116    0.755636    0.745863    0.768148    0.771308
max      0.999851    0.997532    0.998188    0.999079    0.998178

In [521]:
#to get the info about the df
newdf.head()

          0         1         2         3         4
0  0.449980  0.173804  0.406991  0.750502  0.288611
1  0.565045  0.875446  0.675996  0.800321  0.148256
2  0.503652  0.643002  0.746705  0.449030  0.359206
3  0.303958  0.981712  0.485845  0.456453  0.751505
4  0.091031  0.772639  0.802083  0.144733  0.186428

In [522]:
#to know the data type
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [523]:
newdf[0][0]="Bishal Shah"

/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_16937/674700252.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0]="Bishal Shah"
/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_16937/674700252.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Bishal Shah' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]="Bishal Shah"

In [524]:
newdf

               0         1         2         3         4
0    Bishal Shah  0.173804  0.406991  0.750502  0.288611
1       0.565045  0.875446  0.675996  0.800321  0.148256
2       0.503652  0.643002  0.746705  0.449030  0.359206
3       0.303958  0.981712  0.485845  0.456453  0.751505
4       0.091031  0.772639  0.802083  0.144733  0.186428
..           ...       ...       ...       ...       ...
329      0.69187  0.392796  0.493666  0.318807  0.147284
330      0.64204  0.771727  0.462133  0.317996  0.563462
331     0.978465  0.377199  0.594443  0.646245  0.683017
332     0.628358  0.283826  0.438093  0.017947  0.361380
333     0.175887  0.282770  0.222401  0.140203  0.776492

[334 rows x 5 columns]

In [525]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [526]:
#printing the index
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [527]:
#columns
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [528]:
#to convert into the numpy
newdf.to_numpy()

array([['Bishal Shah', 0.17380378038474542, 0.40699093988693147,
        0.7505024378515764, 0.2886114980501975],
       [0.5650454157819369, 0.8754459437225786, 0.675996428879879,
        0.8003210585167154, 0.14825556281245822],
       [0.503651645131874, 0.6430021934588599, 0.7467046682000813,
        0.44903040890731405, 0.3592055283001442],
       ...,
       [0.9784646581552059, 0.3771989426058292, 0.5944429296625928,
        0.6462449757398826, 0.6830168988012392],
       [0.6283582364319822, 0.2838261063167583, 0.43809278476079094,
        0.017947171369838477, 0.36138045507529803],
       [0.1758865379562765, 0.28277003097376097, 0.22240098225802551,
        0.1402026585284668, 0.7764917868121332]],
      shape=(334, 5), dtype=object)

In [529]:
newdf[0][0]=np.random.rand()

In [530]:
newdf

            0         1         2         3         4
0    0.695221  0.173804  0.406991  0.750502  0.288611
1    0.565045  0.875446  0.675996  0.800321  0.148256
2    0.503652  0.643002  0.746705  0.449030  0.359206
3    0.303958  0.981712  0.485845  0.456453  0.751505
4    0.091031  0.772639  0.802083  0.144733  0.186428
..        ...       ...       ...       ...       ...
329   0.69187  0.392796  0.493666  0.318807  0.147284
330   0.64204  0.771727  0.462133  0.317996  0.563462
331  0.978465  0.377199  0.594443  0.646245  0.683017
332  0.628358  0.283826  0.438093  0.017947  0.361380
333  0.175887  0.282770  0.222401  0.140203  0.776492

[334 rows x 5 columns]

In [531]:
newdf.to_numpy()

array([[0.6952212651026767, 0.17380378038474542, 0.40699093988693147,
        0.7505024378515764, 0.2886114980501975],
       [0.5650454157819369, 0.8754459437225786, 0.675996428879879,
        0.8003210585167154, 0.14825556281245822],
       [0.503651645131874, 0.6430021934588599, 0.7467046682000813,
        0.44903040890731405, 0.3592055283001442],
       ...,
       [0.9784646581552059, 0.3771989426058292, 0.5944429296625928,
        0.6462449757398826, 0.6830168988012392],
       [0.6283582364319822, 0.2838261063167583, 0.43809278476079094,
        0.017947171369838477, 0.36138045507529803],
       [0.1758865379562765, 0.28277003097376097, 0.22240098225802551,
        0.1402026585284668, 0.7764917868121332]],
      shape=(334, 5), dtype=object)

In [532]:
#to convert the row->column and the vice versa
#simply transpose
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.695221,0.565045,0.503652,0.303958,0.091031,0.422088,0.765555,0.833987,0.319716,0.459095,...,0.220749,0.252523,0.890826,0.593802,0.77807,0.69187,0.64204,0.978465,0.628358,0.175887
1,0.173804,0.875446,0.643002,0.981712,0.772639,0.899371,0.555178,0.196484,0.212175,0.345908,...,0.845148,0.419656,0.937888,0.792867,0.639984,0.392796,0.771727,0.377199,0.283826,0.28277
2,0.406991,0.675996,0.746705,0.485845,0.802083,0.02161,0.758579,0.230091,0.132626,0.833898,...,0.439645,0.388898,0.691567,0.570152,0.755679,0.493666,0.462133,0.594443,0.438093,0.222401
3,0.750502,0.800321,0.44903,0.456453,0.144733,0.587218,0.355582,0.121334,0.843076,0.649231,...,0.114383,0.421079,0.500888,0.213609,0.775329,0.318807,0.317996,0.646245,0.017947,0.140203
4,0.288611,0.148256,0.359206,0.751505,0.186428,0.471237,0.380097,0.278705,0.857242,0.340997,...,0.739382,0.056581,0.138353,0.739343,0.331473,0.147284,0.563462,0.683017,0.36138,0.776492

In [533]:
#to reverse sort the rows
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.175887  0.282770  0.222401  0.140203  0.776492
332  0.628358  0.283826  0.438093  0.017947  0.361380
331  0.978465  0.377199  0.594443  0.646245  0.683017
330   0.64204  0.771727  0.462133  0.317996  0.563462
329   0.69187  0.392796  0.493666  0.318807  0.147284
..        ...       ...       ...       ...       ...
4    0.091031  0.772639  0.802083  0.144733  0.186428
3    0.303958  0.981712  0.485845  0.456453  0.751505
2    0.503652  0.643002  0.746705  0.449030  0.359206
1    0.565045  0.875446  0.675996  0.800321  0.148256
0    0.695221  0.173804  0.406991  0.750502  0.288611

[334 rows x 5 columns]

In [534]:
#to reverse sort the columns
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.288611  0.750502  0.406991  0.173804  0.695221
1    0.148256  0.800321  0.675996  0.875446  0.565045
2    0.359206  0.449030  0.746705  0.643002  0.503652
3    0.751505  0.456453  0.485845  0.981712  0.303958
4    0.186428  0.144733  0.802083  0.772639  0.091031
..        ...       ...       ...       ...       ...
329  0.147284  0.318807  0.493666  0.392796   0.69187
330  0.563462  0.317996  0.462133  0.771727   0.64204
331  0.683017  0.646245  0.594443  0.377199  0.978465
332  0.361380  0.017947  0.438093  0.283826  0.628358
333  0.776492  0.140203  0.222401  0.282770  0.175887

[334 rows x 5 columns]

In [535]:
newdf

            0         1         2         3         4
0    0.695221  0.173804  0.406991  0.750502  0.288611
1    0.565045  0.875446  0.675996  0.800321  0.148256
2    0.503652  0.643002  0.746705  0.449030  0.359206
3    0.303958  0.981712  0.485845  0.456453  0.751505
4    0.091031  0.772639  0.802083  0.144733  0.186428
..        ...       ...       ...       ...       ...
329   0.69187  0.392796  0.493666  0.318807  0.147284
330   0.64204  0.771727  0.462133  0.317996  0.563462
331  0.978465  0.377199  0.594443  0.646245  0.683017
332  0.628358  0.283826  0.438093  0.017947  0.361380
333  0.175887  0.282770  0.222401  0.140203  0.776492

[334 rows x 5 columns]

In [536]:
#to access all the elements at 0th column
newdf[0]

0      0.695221
1      0.565045
2      0.503652
3      0.303958
4      0.091031
         ...
329     0.69187
330     0.64204
331    0.978465
332    0.628358
333    0.175887
Name: 0, Length: 334, dtype: object

In [537]:
#inorder to remove the warning, we use .lock[0][0] for the replacement of the value
newdf.loc[0,0]=11

In [538]:
newdf.head()

          0         1         2         3         4
0        11  0.173804  0.406991  0.750502  0.288611
1  0.565045  0.875446  0.675996  0.800321  0.148256
2  0.503652  0.643002  0.746705  0.449030  0.359206
3  0.303958  0.981712  0.485845  0.456453  0.751505
4  0.091031  0.772639  0.802083  0.144733  0.186428

In [539]:
#to set the columns name
newdf.columns=list("ABCDE")

In [540]:
newdf

            A         B         C         D         E
0          11  0.173804  0.406991  0.750502  0.288611
1    0.565045  0.875446  0.675996  0.800321  0.148256
2    0.503652  0.643002  0.746705  0.449030  0.359206
3    0.303958  0.981712  0.485845  0.456453  0.751505
4    0.091031  0.772639  0.802083  0.144733  0.186428
..        ...       ...       ...       ...       ...
329   0.69187  0.392796  0.493666  0.318807  0.147284
330   0.64204  0.771727  0.462133  0.317996  0.563462
331  0.978465  0.377199  0.594443  0.646245  0.683017
332  0.628358  0.283826  0.438093  0.017947  0.361380
333  0.175887  0.282770  0.222401  0.140203  0.776492

[334 rows x 5 columns]

In [541]:
#so now if we want to access 11, we need to [0,'A']

In [542]:
newdf

            A         B         C         D         E
0          11  0.173804  0.406991  0.750502  0.288611
1    0.565045  0.875446  0.675996  0.800321  0.148256
2    0.503652  0.643002  0.746705  0.449030  0.359206
3    0.303958  0.981712  0.485845  0.456453  0.751505
4    0.091031  0.772639  0.802083  0.144733  0.186428
..        ...       ...       ...       ...       ...
329   0.69187  0.392796  0.493666  0.318807  0.147284
330   0.64204  0.771727  0.462133  0.317996  0.563462
331  0.978465  0.377199  0.594443  0.646245  0.683017
332  0.628358  0.283826  0.438093  0.017947  0.361380
333  0.175887  0.282770  0.222401  0.140203  0.776492

[334 rows x 5 columns]

In [543]:
#to remove the last column
newdf.drop(0,axis=0)

            A         B         C         D         E
1    0.565045  0.875446  0.675996  0.800321  0.148256
2    0.503652  0.643002  0.746705  0.449030  0.359206
3    0.303958  0.981712  0.485845  0.456453  0.751505
4    0.091031  0.772639  0.802083  0.144733  0.186428
5    0.422088  0.899371  0.021610  0.587218  0.471237
..        ...       ...       ...       ...       ...
329   0.69187  0.392796  0.493666  0.318807  0.147284
330   0.64204  0.771727  0.462133  0.317996  0.563462
331  0.978465  0.377199  0.594443  0.646245  0.683017
332  0.628358  0.283826  0.438093  0.017947  0.361380
333  0.175887  0.282770  0.222401  0.140203  0.776492

[333 rows x 5 columns]

In [544]:
newdf.loc[0,'A']=90

In [545]:
newdf

            A         B         C         D         E
0          90  0.173804  0.406991  0.750502  0.288611
1    0.565045  0.875446  0.675996  0.800321  0.148256
2    0.503652  0.643002  0.746705  0.449030  0.359206
3    0.303958  0.981712  0.485845  0.456453  0.751505
4    0.091031  0.772639  0.802083  0.144733  0.186428
..        ...       ...       ...       ...       ...
329   0.69187  0.392796  0.493666  0.318807  0.147284
330   0.64204  0.771727  0.462133  0.317996  0.563462
331  0.978465  0.377199  0.594443  0.646245  0.683017
332  0.628358  0.283826  0.438093  0.017947  0.361380
333  0.175887  0.282770  0.222401  0.140203  0.776492

[334 rows x 5 columns]

In [546]:
newdf.loc[0,'A']=901
newdf

            A         B         C         D         E
0         901  0.173804  0.406991  0.750502  0.288611
1    0.565045  0.875446  0.675996  0.800321  0.148256
2    0.503652  0.643002  0.746705  0.449030  0.359206
3    0.303958  0.981712  0.485845  0.456453  0.751505
4    0.091031  0.772639  0.802083  0.144733  0.186428
..        ...       ...       ...       ...       ...
329   0.69187  0.392796  0.493666  0.318807  0.147284
330   0.64204  0.771727  0.462133  0.317996  0.563462
331  0.978465  0.377199  0.594443  0.646245  0.683017
332  0.628358  0.283826  0.438093  0.017947  0.361380
333  0.175887  0.282770  0.222401  0.140203  0.776492

[334 rows x 5 columns]

In [547]:
newdf.head()

          A         B         C         D         E
0       901  0.173804  0.406991  0.750502  0.288611
1  0.565045  0.875446  0.675996  0.800321  0.148256
2  0.503652  0.643002  0.746705  0.449030  0.359206
3  0.303958  0.981712  0.485845  0.456453  0.751505
4  0.091031  0.772639  0.802083  0.144733  0.186428

In [548]:
newdf.drop(1, axis=0)#removed the data of  1st row

            A         B         C         D         E
0         901  0.173804  0.406991  0.750502  0.288611
2    0.503652  0.643002  0.746705  0.449030  0.359206
3    0.303958  0.981712  0.485845  0.456453  0.751505
4    0.091031  0.772639  0.802083  0.144733  0.186428
5    0.422088  0.899371  0.021610  0.587218  0.471237
..        ...       ...       ...       ...       ...
329   0.69187  0.392796  0.493666  0.318807  0.147284
330   0.64204  0.771727  0.462133  0.317996  0.563462
331  0.978465  0.377199  0.594443  0.646245  0.683017
332  0.628358  0.283826  0.438093  0.017947  0.361380
333  0.175887  0.282770  0.222401  0.140203  0.776492

[333 rows x 5 columns]

In [549]:
newdf.drop(3,axis=0)#removed the data of  3rd  row

            A         B         C         D         E
0         901  0.173804  0.406991  0.750502  0.288611
1    0.565045  0.875446  0.675996  0.800321  0.148256
2    0.503652  0.643002  0.746705  0.449030  0.359206
4    0.091031  0.772639  0.802083  0.144733  0.186428
5    0.422088  0.899371  0.021610  0.587218  0.471237
..        ...       ...       ...       ...       ...
329   0.69187  0.392796  0.493666  0.318807  0.147284
330   0.64204  0.771727  0.462133  0.317996  0.563462
331  0.978465  0.377199  0.594443  0.646245  0.683017
332  0.628358  0.283826  0.438093  0.017947  0.361380
333  0.175887  0.282770  0.222401  0.140203  0.776492

[333 rows x 5 columns]

In [550]:
newdf.drop('D', axis=1)#the axis=1 denotes column and 0 denotes row
newdf1=newdf.drop('A', axis=1)#the axis=1 denotes column and 0 denotes row
newdf1

            B         C         D         E
0    0.173804  0.406991  0.750502  0.288611
1    0.875446  0.675996  0.800321  0.148256
2    0.643002  0.746705  0.449030  0.359206
3    0.981712  0.485845  0.456453  0.751505
4    0.772639  0.802083  0.144733  0.186428
..        ...       ...       ...       ...
329  0.392796  0.493666  0.318807  0.147284
330  0.771727  0.462133  0.317996  0.563462
331  0.377199  0.594443  0.646245  0.683017
332  0.283826  0.438093  0.017947  0.361380
333  0.282770  0.222401  0.140203  0.776492

[334 rows x 4 columns]

In [551]:
newdf.head(3)

          A         B         C         D         E
0       901  0.173804  0.406991  0.750502  0.288611
1  0.565045  0.875446  0.675996  0.800321  0.148256
2  0.503652  0.643002  0.746705  0.449030  0.359206

In [552]:
newdf.loc[1,'A']=90

In [553]:
newdf.head()

          A         B         C         D         E
0       901  0.173804  0.406991  0.750502  0.288611
1        90  0.875446  0.675996  0.800321  0.148256
2  0.503652  0.643002  0.746705  0.449030  0.359206
3  0.303958  0.981712  0.485845  0.456453  0.751505
4  0.091031  0.772639  0.802083  0.144733  0.186428

In [554]:
newdf.drop(0, axis=0)#0->row & 1-> columns

            A         B         C         D         E
1          90  0.875446  0.675996  0.800321  0.148256
2    0.503652  0.643002  0.746705  0.449030  0.359206
3    0.303958  0.981712  0.485845  0.456453  0.751505
4    0.091031  0.772639  0.802083  0.144733  0.186428
5    0.422088  0.899371  0.021610  0.587218  0.471237
..        ...       ...       ...       ...       ...
329   0.69187  0.392796  0.493666  0.318807  0.147284
330   0.64204  0.771727  0.462133  0.317996  0.563462
331  0.978465  0.377199  0.594443  0.646245  0.683017
332  0.628358  0.283826  0.438093  0.017947  0.361380
333  0.175887  0.282770  0.222401  0.140203  0.776492

[333 rows x 5 columns]

In [555]:
newdf

            A         B         C         D         E
0         901  0.173804  0.406991  0.750502  0.288611
1          90  0.875446  0.675996  0.800321  0.148256
2    0.503652  0.643002  0.746705  0.449030  0.359206
3    0.303958  0.981712  0.485845  0.456453  0.751505
4    0.091031  0.772639  0.802083  0.144733  0.186428
..        ...       ...       ...       ...       ...
329   0.69187  0.392796  0.493666  0.318807  0.147284
330   0.64204  0.771727  0.462133  0.317996  0.563462
331  0.978465  0.377199  0.594443  0.646245  0.683017
332  0.628358  0.283826  0.438093  0.017947  0.361380
333  0.175887  0.282770  0.222401  0.140203  0.776492

[334 rows x 5 columns]

In [556]:
newdf.loc[[1,2,3,4,5,36],['C','D','E']] #to access particular no. of rows and columns

           C         D         E
1   0.675996  0.800321  0.148256
2   0.746705  0.449030  0.359206
3   0.485845  0.456453  0.751505
4   0.802083  0.144733  0.186428
5   0.021610  0.587218  0.471237
36  0.231017  0.982288  0.122172

In [557]:
newdf

            A         B         C         D         E
0         901  0.173804  0.406991  0.750502  0.288611
1          90  0.875446  0.675996  0.800321  0.148256
2    0.503652  0.643002  0.746705  0.449030  0.359206
3    0.303958  0.981712  0.485845  0.456453  0.751505
4    0.091031  0.772639  0.802083  0.144733  0.186428
..        ...       ...       ...       ...       ...
329   0.69187  0.392796  0.493666  0.318807  0.147284
330   0.64204  0.771727  0.462133  0.317996  0.563462
331  0.978465  0.377199  0.594443  0.646245  0.683017
332  0.628358  0.283826  0.438093  0.017947  0.361380
333  0.175887  0.282770  0.222401  0.140203  0.776492

[334 rows x 5 columns]

In [558]:
newdf.loc[:,['A']]  #to access all the rows of A

            A
0         901
1          90
2    0.503652
3    0.303958
4    0.091031
..        ...
329   0.69187
330   0.64204
331  0.978465
332  0.628358
333  0.175887

[334 rows x 1 columns]

In [559]:
newdf.loc[[7],:] #to access all the columns of 7

          A         B         C         D         E
7  0.833987  0.196484  0.230091  0.121334  0.278705

In [560]:
newdf.loc[(newdf['A']>0.9)]

            A         B         C         D         E
0         901  0.173804  0.406991  0.750502  0.288611
1          90  0.875446  0.675996  0.800321  0.148256
13   0.944981  0.077851  0.934153  0.541974  0.410949
22    0.93389  0.727671  0.777677  0.713432  0.171049
23   0.908393  0.783638  0.218035  0.864086  0.285184
54   0.947876  0.128257  0.202510  0.230705  0.054073
56   0.956497  0.204445  0.454313  0.023526  0.474938
58    0.95959  0.095151  0.784380  0.848061  0.051054
74   0.997337  0.745055  0.285591  0.694313  0.521438
80   0.995805  0.839604  0.214493  0.898456  0.914772
83   0.981269  0.415096  0.922712  0.557244  0.537661
87   0.960808  0.801315  0.626710  0.112625  0.116210
96   0.906174  0.534368  0.065923  0.432688  0.439254
97   0.937556  0.681125  0.492244  0.028659  0.515999
109  0.926272  0.738263  0.677377  0.615681  0.964704
122  0.946993  0.751509  0.994509  0.870744  0.283109
126  0.973635  0.292078  0.475140  0.821155  0.662748
131  0.942097  0.686469  0.695195  0.129441  0.231600
137  0.979988  0.346920  0.384977  0.588688  0.303333
162  0.906007  0.997532  0.349529  0.982486  0.849533
173  0.933583  0.747350  0.872965  0.310134  0.585773
174  0.999851  0.413129  0.801855  0.151577  0.056496
176   0.92133  0.434565  0.859571  0.301156  0.981906
188  0.939636  0.755014  0.165872  0.723051  0.933203
209  0.923371  0.457069  0.987775  0.920870  0.430960
220  0.972552  0.468625  0.591645  0.690501  0.017898
221  0.980226  0.776946  0.220716  0.220273  0.972458
277  0.979201  0.058322  0.734874  0.500261  0.691053
281  0.994199  0.354788  0.163682  0.252122  0.610451
285  0.983814  0.825863  0.507496  0.621454  0.089858
287  0.991142  0.265031  0.348266  0.240504  0.036827
292   0.94807  0.718390  0.449443  0.906175  0.912205
303  0.925692  0.149014  0.498311  0.169763  0.962800
304  0.920874  0.861488  0.771291  0.640000  0.534684
307  0.921536  0.460679  0.119463  0.651131  0.987011
309   0.95217  0.715935  0.281665  0.086578  0.548299
323  0.919051  0.542770  0.593044  0.972980  0.088391
331  0.978465  0.377199  0.594443  0.646245  0.683017

In [561]:
newdf

            A         B         C         D         E
0         901  0.173804  0.406991  0.750502  0.288611
1          90  0.875446  0.675996  0.800321  0.148256
2    0.503652  0.643002  0.746705  0.449030  0.359206
3    0.303958  0.981712  0.485845  0.456453  0.751505
4    0.091031  0.772639  0.802083  0.144733  0.186428
..        ...       ...       ...       ...       ...
329   0.69187  0.392796  0.493666  0.318807  0.147284
330   0.64204  0.771727  0.462133  0.317996  0.563462
331  0.978465  0.377199  0.594443  0.646245  0.683017
332  0.628358  0.283826  0.438093  0.017947  0.361380
333  0.175887  0.282770  0.222401  0.140203  0.776492

[334 rows x 5 columns]

In [562]:
newdf.iloc[0,3]#when we only know the index | if we know the column value we use loc

np.float64(0.7505024378515764)

In [563]:
newdf.iloc[[0,6],:]

          A         B         C         D         E
0       901  0.173804  0.406991  0.750502  0.288611
6  0.765555  0.555178  0.758579  0.355582  0.380097

In [564]:
newdf.iloc[:,[0,1]]

            A         B
0         901  0.173804
1          90  0.875446
2    0.503652  0.643002
3    0.303958  0.981712
4    0.091031  0.772639
..        ...       ...
329   0.69187  0.392796
330   0.64204  0.771727
331  0.978465  0.377199
332  0.628358  0.283826
333  0.175887  0.282770

[334 rows x 2 columns]

In [565]:
newdf.drop(0, axis=0) # also another way without name of the column
newdf.drop([0])

            A         B         C         D         E
1          90  0.875446  0.675996  0.800321  0.148256
2    0.503652  0.643002  0.746705  0.449030  0.359206
3    0.303958  0.981712  0.485845  0.456453  0.751505
4    0.091031  0.772639  0.802083  0.144733  0.186428
5    0.422088  0.899371  0.021610  0.587218  0.471237
..        ...       ...       ...       ...       ...
329   0.69187  0.392796  0.493666  0.318807  0.147284
330   0.64204  0.771727  0.462133  0.317996  0.563462
331  0.978465  0.377199  0.594443  0.646245  0.683017
332  0.628358  0.283826  0.438093  0.017947  0.361380
333  0.175887  0.282770  0.222401  0.140203  0.776492

[333 rows x 5 columns]

In [566]:
newdf.drop('A', axis=1)

            B         C         D         E
0    0.173804  0.406991  0.750502  0.288611
1    0.875446  0.675996  0.800321  0.148256
2    0.643002  0.746705  0.449030  0.359206
3    0.981712  0.485845  0.456453  0.751505
4    0.772639  0.802083  0.144733  0.186428
..        ...       ...       ...       ...
329  0.392796  0.493666  0.318807  0.147284
330  0.771727  0.462133  0.317996  0.563462
331  0.377199  0.594443  0.646245  0.683017
332  0.283826  0.438093  0.017947  0.361380
333  0.282770  0.222401  0.140203  0.776492

[334 rows x 4 columns]

In [567]:
newdf.drop(['A','C'], axis=1)

            B         D         E
0    0.173804  0.750502  0.288611
1    0.875446  0.800321  0.148256
2    0.643002  0.449030  0.359206
3    0.981712  0.456453  0.751505
4    0.772639  0.144733  0.186428
..        ...       ...       ...
329  0.392796  0.318807  0.147284
330  0.771727  0.317996  0.563462
331  0.377199  0.646245  0.683017
332  0.283826  0.017947  0.361380
333  0.282770  0.140203  0.776492

[334 rows x 3 columns]

In [568]:
newdf.drop(['A','B'], axis=1, inplace=True)# column A & B will be permanently deleted

In [569]:
newdf

            C         D         E
0    0.406991  0.750502  0.288611
1    0.675996  0.800321  0.148256
2    0.746705  0.449030  0.359206
3    0.485845  0.456453  0.751505
4    0.802083  0.144733  0.186428
..        ...       ...       ...
329  0.493666  0.318807  0.147284
330  0.462133  0.317996  0.563462
331  0.594443  0.646245  0.683017
332  0.438093  0.017947  0.361380
333  0.222401  0.140203  0.776492

[334 rows x 3 columns]

In [570]:
newdf.drop([1,2,3,4], axis=0, inplace=True)

In [571]:
newdf

            C         D         E
0    0.406991  0.750502  0.288611
5    0.021610  0.587218  0.471237
6    0.758579  0.355582  0.380097
7    0.230091  0.121334  0.278705
8    0.132626  0.843076  0.857242
..        ...       ...       ...
329  0.493666  0.318807  0.147284
330  0.462133  0.317996  0.563462
331  0.594443  0.646245  0.683017
332  0.438093  0.017947  0.361380
333  0.222401  0.140203  0.776492

[330 rows x 3 columns]

In [572]:
newdf.reset_index()  # to reset the index

     index         C         D         E
0        0  0.406991  0.750502  0.288611
1        5  0.021610  0.587218  0.471237
2        6  0.758579  0.355582  0.380097
3        7  0.230091  0.121334  0.278705
4        8  0.132626  0.843076  0.857242
..     ...       ...       ...       ...
325    329  0.493666  0.318807  0.147284
326    330  0.462133  0.317996  0.563462
327    331  0.594443  0.646245  0.683017
328    332  0.438093  0.017947  0.361380
329    333  0.222401  0.140203  0.776492

[330 rows x 4 columns]

In [573]:
newdf.reset_index(drop=True, inplace=True)  # to remove the 'index' columns

In [574]:
newdf

            C         D         E
0    0.406991  0.750502  0.288611
1    0.021610  0.587218  0.471237
2    0.758579  0.355582  0.380097
3    0.230091  0.121334  0.278705
4    0.132626  0.843076  0.857242
..        ...       ...       ...
325  0.493666  0.318807  0.147284
326  0.462133  0.317996  0.563462
327  0.594443  0.646245  0.683017
328  0.438093  0.017947  0.361380
329  0.222401  0.140203  0.776492

[330 rows x 3 columns]

In [575]:
newdf.loc[:,['C']]=None
newdf

/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_16937/1589854205.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'None' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf.loc[:,['C']]=None

        C         D         E
0    None  0.750502  0.288611
1    None  0.587218  0.471237
2    None  0.355582  0.380097
3    None  0.121334  0.278705
4    None  0.843076  0.857242
..    ...       ...       ...
325  None  0.318807  0.147284
326  None  0.317996  0.563462
327  None  0.646245  0.683017
328  None  0.017947  0.361380
329  None  0.140203  0.776492

[330 rows x 3 columns]

In [576]:
newdf.loc[0,'D']=None
newdf

        C         D         E
0    None       NaN  0.288611
1    None  0.587218  0.471237
2    None  0.355582  0.380097
3    None  0.121334  0.278705
4    None  0.843076  0.857242
..    ...       ...       ...
325  None  0.318807  0.147284
326  None  0.317996  0.563462
327  None  0.646245  0.683017
328  None  0.017947  0.361380
329  None  0.140203  0.776492

[330 rows x 3 columns]

In [577]:
newdf['D'].isnull()

0       True
1      False
2      False
3      False
4      False
       ...
325    False
326    False
327    False
328    False
329    False
Name: D, Length: 330, dtype: bool

In [578]:
newdf.shape

(330, 3)

In [579]:
newdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 330 entries, 0 to 329
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   C       0 non-null      object
 1   D       329 non-null    float64
 2   E       330 non-null    float64
dtypes: float64(2), object(1)
memory usage: 7.9+ KB

In [580]:
df['name'].values

array(['Harry', 'Rohan', 'Skillf', 'Shubh'], dtype=object)

In [581]:
df['city'].value_counts

<bound method IndexOpsMixin.value_counts of 0       Rampur
1     Bareilly
2        Andra
3    Antartica
Name: city, dtype: object>

In [582]:
newdf['D'].value_counts(dropna=0.542767)

D
0.587218    1
0.921204    1
0.923541    1
0.898882    1
0.343040    1
           ..
0.565852    1
0.348913    1
0.822718    1
0.300370    1
0.140203    1
Name: count, Length: 329, dtype: int64

In [583]:
newdf['D'].value_counts(dropna=0.608930)

D
0.587218    1
0.921204    1
0.923541    1
0.898882    1
0.343040    1
           ..
0.565852    1
0.348913    1
0.822718    1
0.300370    1
0.140203    1
Name: count, Length: 329, dtype: int64

In [584]:
df['city'].value_counts(dropna=False)

city
Rampur       1
Bareilly     1
Andra        1
Antartica    1
Name: count, dtype: int64